import React from 'react';
import Message from './Message';

function MessageMain() {
    return (
        <div className="wrapper" style = {{width: '960px', height: '3000px', position: 'relative'}}>
            <Message top = '-50px' name = 'ジェーン・スー' left2 =  '580px' bw = '720px' bh = '190px' cw = '700px' ch = '170px' marginLeft = '-60px' top2 = '140px' backgroundColor = '#6EBF86'>
                誰にでもある普通の日常を、どこにもない素敵なメロディに載せて歌う。<br/>
                「ああ、川村結花さんだなぁ」と思いながら聴きました。 <br/>
                川村さんの歌はまるで漢方薬で、ゆっくりゆっくり効いてきます。<br/>
                体の隅々までじんわりと行き渡り、気付けば心もポカポカにさせてくれるのです。
            </Message>
            <Message top = '0px' left = '750px' 　name = '柴草玲（ミュージシャン)' left2 = '520px' bw = '720px' bh = '530px' cw = '700px' ch = '510px' marginLeft = '-810px' top2 = '480px' backgroundColor = '#E1A026'>
                今回、結花さんとの共作曲、そしてコーラス録音にて、<br/>
                この素敵なアルバムに関わる機会をいただけたことは、<br/>
                ただただ光栄、幸運、感謝、としか言いようがありません。<br/>
                <br/>
                いつだったか、お互いの、歌を作る原動力について語り合ったことがあります。<br/>
                その時結花さんは、ごくごく自然に本当にあまりにもさりげなく、<br/>
                「愛、かな..」とおっしゃって。<br/>
                ”川村結花”という音楽家の、その魅力と凄さをひとつひとつ挙げてゆこうと思えば、<br/>
                あらゆる方向からいくらでも具体的な言葉が浮かぶのですが、<br/>
                最終的にはその、ごくごく自然であまりにもさりげない、<br/>
                「愛、かな..」に辿り着くような気がします。<br/>
　　　　　　　　　　<br/>
                とにもかくにも、なんという心地よいアルバム、<br/>
                ああ心地よい、小気味好い、あたたかい、と聴き進めてゆくと、<br/>
                ラスト、圧倒的な美しさにじんわりと涙が出ます。<br/>
                敬愛なる親愛なる川村結花さん、すばらしい新譜の完成、<br/>
                心より心より、おめでとうございます。
            </Message>
            <Message name = '鈴木雅之（ヴォーカリスト）' top = '340px' left2 = '500px'  bw = '720px' bh = '390px' cw = '700px' ch = '370px' marginLeft = '-60px' top2 = '340px' backgroundColor = '#6EBF86'>
                思えば、川村結花と出会ってもう20年になる。<br/>
                最初は共通のプロデューサーから<br/>
                「すごくいい曲を書く子がいる！！」だった。<br/>
                そして川村の楽曲を聴いて女性版マッキー（槇原敬之）みたいだな<br/>
                って思ったのを覚えてる。<br/>
                書き下ろしをしてくれた「So Long」ではコラボレーションという言葉が<br/>
                一般的じゃない頃から小田和正さんと3人でスタジオに入ったりもした。<br/>
                生まれては消えて行くこの世界の中で、20年以上経ってもずっとブレずに<br/>
                作り歌い続けてる川村は、やっぱ真のシンガーソングライターだと思う。<br/>
                今回はkyOnと佐橋のレーベルからリリースということで悪いわけがないよね。<br/>
                相変わらずの川村節でみんなの心を温かくしてね。
            </Message>
            <Message top = '200px' left = '750px' 　name = '矢野まき（シンガー・ソングライター）' left2 = '420px' bw = '720px' bh = '180px' cw = '700px' ch = '160px' marginLeft = '-810px' top2 = '130px' backgroundColor = '#E1A026'>
                私は結花さんの情緒や想像力、弱さと強さ、底なしの愛が大好き。<br/>

                「ハレルヤ」が生まれた！<br/>

                まるで上等なクシのように、心の中のもつれを通してくれる。<br/>

                私は私でいいんだって思わせてくれる作品たち。感謝でいっぱいだ。。

            </Message>
            <Message name = 'ファンキー加藤（アーティスト)' top = '-10px' left2 = '470px' bw = '720px' bh = '160px' cw = '700px' ch = '140px' marginLeft = '-60px' top2 = '110px' backgroundColor = '#6EBF86'>
                川村結花さんの詞は記憶に、旋律は心に、優しく触れてきます。<br/>
                ファンモン時代から、こんな僕の音楽人生を、幾度も救ってくれました。<br/>
                どうぞ皆さんも『ハレルヤ』で温かい日々を。<br/>
            </Message>
            <Message top = '-30px' left = '750px' 　name = '渡辺美里（ヴォーカリスト）' left2 = '490px' bw = '720px' bh = '690px' cw = '700px' ch = '670px' marginLeft = '-810px' top2 = '640px' backgroundColor = '#E1A026'>
                川村さんと私。<br/>
                失礼ながら、どこかとっても似ているような気がしてならないのです。<br/>

                あっけらかん！と、ざっくばらん！な様でいて、本当はとっても人見知り。<br/>
                例えば、同じ教室でクラスの人達の事を俯瞰で見ながら観察していたり、<br/>
                ぼんやりと授業中、窓の外を眺めては自分の世界を旅しているような…。<br/>
                もちろん、それでもちゃんとお勉強出来るのは川村さん、<br/>
                やれば出来る子と言われ続けてやらないのが私(笑)<br/>
                <br/>
                「片づけよう、ちゃんとしよう、本気だそう」ってずーっと思ってきたから、<br/>
                曲を聞いた時はドキッ！！！としました。<br/>

                川村さんとはもう10年以上の繋がりがあって、<br/>
                ステキな曲を数々提供していただいたり、TVでライブもご一緒したりしているし、<br/>
                ピアニストとしてレコーディングにも参加してもらっているのに、<br/>
                未だにお互い「川村さん」「美里さん」と呼びあっていますね。<br/>
                <br/>
                アルバム「ハレルヤ」は、温かくて、やわらかで、<br/>
                ずっと触れていたい上質なブランケットのような作品。<br/>
                もしくは、 ずっと抱っこしていたいワンコのようなほっこりかげん。<br/>
                <br/>
                カワムラ鉄工所の機械の音も、お隣のコロッケのにおいも、私なんで知ってるんだろ。<br/>
                ねぇねぇ川村さん、今度会う時は「結花ちゃん」って呼ばせてね。 <br/>
                だって私達 同級生なんだもん！！！<br/>
                アルバム完成 おめでとうございます。
            </Message>
            <Message name = '松下奈緒 （女優・アーティスト）' top = '500px' left2 = '470px' bw = '720px' bh = '310px' cw = '700px' ch = '290px' marginLeft = '-60px' top2 = '260px' backgroundColor = '#6EBF86'>
                １曲目から、まさかのサプライズで、『大阪市旭区森小路5丁目2番地』! <br/>
                 情景が浮かびました!<br/>
                Jazzな雰囲気も盛りだくさんで、どの歌も私のタイプです♪<br/>
                やっぱり私は、川村さんの紡ぐ言葉、奏でるメロディーや歌声、<br/>
                そして楽しいお人柄も大好きなんだなと改めて実感した作品でした。<br/>
                私、大ファンです(笑)<br/>
                川村さんの音楽は、いつも優しさと、爽やかさを下さいます。<br/>
                これからも、 私は川村結花さんが生み出す世界観を楽しみにしております。 <br/>
                関西弁トークまた、したいです!！<br/>

            </Message>

            <Message name = '佐橋佳幸（Darjeeling）' top = '120px' left2 = '540px' bw = '720px' bh = '180px' cw = '700px' ch = '160px' marginLeft = '-60px' top2 = '130px' backgroundColor = '#E1A026'>
                この３０余年、たくさんの作品作りに関わってきましたが、<br/>
                日本のシンガーソングライターのあるべき姿を、<br/>
                ここまで表現することができたことはありませんでした。<br/>
                結花ちゃんの”音楽力”を、思う存分味わっていただければと思います。<br/>
            </Message>

            <Message top = '-10px' left = '750px' 　name = 'Dr.kyOn（Darjeeling)' left2 = '550px' bw = '720px' bh = '250px' cw = '700px' ch = '230px' marginLeft = '-810px' top2 = '200px' backgroundColor = '#6EBF86'>
                Crazy Fingersでご縁があった結花ちゃんとは<br/>
                もちのろん６０Ｈｚ出身同志<br/>
                作業当初は「これってドッキリ？ちゃいますのん」<br/>
                何度も確認してたね<br/>
                「ちゃうちゃうできた作品がドッキリする最高の作品やで」<br/>
                その通りになりました<br/>
                「えーーーーよ」
            </Message>
        </div>
    )
}

export default MessageMain;